dormitories = {
    "color": "MediumVioletRed",
    "weight": 3,
    "building": [{
        "name": "Общежитие Металлург-4",
        "address": "Москва, ул. Академика Волгина, д. 4",
        "info": "В здании общежития есть прачечная, кафе, салон красоты.",
        "img": "https://cdn1.iconfinder.com/data/icons/university-indigo-vol-2/256/Roommate-1024.png",
        "loc":
        [
            [55.6548868, 37.5211020],  # общежитие М4
            [55.6545897, 37.5207126],
            [55.6545441, 37.5208220],
            [55.6544221, 37.5206622],
            [55.6543784, 37.5207668],
            [55.6544080, 37.5208056],
            [55.6543765, 37.5208811],
            [55.6545532, 37.5211127],
            [55.6545931, 37.5210172],
            [55.6548284, 37.5213256],
            [55.6548634, 37.5212418],
            [55.6548409, 37.5212122],
            [55.6548868, 37.5211020]
        ]},
        {
        "name": "Общежитие Горняк-1",
        "address": "Москва, пр. 60-летия Октября, д. 15",
        "info": "В здании общажития есть столовая и кафе.",
        "img": "https://cdn1.iconfinder.com/data/icons/university-indigo-vol-2/256/Roommate-1024.png",
        "loc":
        [
            [55.6969, 37.57843],  # общежитие Г-1
            [55.69718, 37.57853],
            [55.6972, 37.5784],
            [55.69737, 37.57846],
            [55.69734, 37.57871],
            [55.6972, 37.57866],
            [55.69718, 37.57879],
            [55.69687, 37.57868],
            [55.6969, 37.57843],

        ]},
        {
        "name": "Общежитие Горняк-2",
        "address": "Москва, пр. 60-летия Октября, д. 11",
        "info": "В здании общажития есть продуктовый круглосуточный магазин и прачечная.",
        "img": "https://cdn1.iconfinder.com/data/icons/university-indigo-vol-2/256/Roommate-1024.png",
        "loc":
        [
            [55.69795, 37.5787],  # общежитие Г-2
            [55.69802, 37.57872],
            [55.69803, 37.57868],
            [55.69809, 37.5787],
            [55.69803, 37.5792],
            [55.6981, 37.57923],
            [55.69806, 37.57962],
            [55.69798, 37.5796],
            [55.69798, 37.57964],
            [55.69792, 37.57961],
            [55.69795, 37.57936],
            [55.69788, 37.57934],
            [55.69795, 37.5787]
        ]},
        {
        "name": "Общежитие Дом-коммуна",
        "address": "Москва, Ленинский проспект, д. 4А, стр. 23",
        "info": "В здании общажития есть столовая и конференц-зал.",
        "img": "https://cdn1.iconfinder.com/data/icons/university-indigo-vol-2/256/Roommate-1024.png",
        "loc":
        [
            [55.71069, 37.59603],  # общежитие ДК
            [55.71067, 37.59603],
            [55.71067, 37.5962],
            [55.71065, 37.5962],
            [55.71065, 37.59594],
            [55.7108, 37.59595],
            [55.7108, 37.59603],
            [55.71099, 37.59604],
            [55.71099, 37.596],
            [55.71094, 37.59597],
            [55.71095, 37.59594],
            [55.71102, 37.59597],
            [55.71109, 37.59595],
            [55.7111, 37.59598],
            [55.71105, 37.596],
            [55.71105, 37.59604],
            [55.71125, 37.59605],
            [55.71126, 37.59559],
            [55.71128, 37.5956],
            [55.71128, 37.5955],
            [55.71089, 37.59547],
            [55.71089, 37.59556],
            [55.71088, 37.59559],
            [55.71087, 37.5956],
            [55.71085, 37.59559],
            [55.71084, 37.59557],
            [55.71084, 37.59547],
            [55.7104, 37.59543],
            [55.7104, 37.5953],
            [55.71046, 37.5953],
            [55.71046, 37.59527],
            [55.71056, 37.59528],
            [55.71056, 37.59531],
            [55.7113, 37.59536],
            [55.7113, 37.59534],
            [55.71134, 37.59534],
            [55.71134, 37.59537],
            [55.71208, 37.59542],
            [55.71208, 37.5954],
            [55.71218, 37.5954],
            [55.71218, 37.59543],
            [55.71221, 37.59543],
            [55.7122, 37.59557],
            [55.71175, 37.59553],
            [55.71174, 37.59561],
            [55.71174, 37.59564],
            [55.71172, 37.59565],
            [55.7117, 37.59564],
            [55.71169, 37.59561],
            [55.71169, 37.59553],
            [55.71137, 37.5955],
            [55.71136, 37.5956],
            [55.7114, 37.5956],
            [55.71139, 37.59634],
            [55.7118, 37.59636],
            [55.71179, 37.59677],
            [55.71169, 37.59676],
            [55.71169, 37.59679],
            [55.71162, 37.59679],
            [55.71161, 37.59679],
            [55.71077, 37.59675],
            [55.71076, 37.59679],
            [55.71075, 37.59681],
            [55.71073, 37.5968],
            [55.71072, 37.59678],
            [55.71072, 37.59671],
            [55.71068, 37.59671],
            [55.71069, 37.59661],
            [55.71068, 37.59661],
            [55.71069, 37.59603]
        ]},
        {
        "name": "Общежитие Дорогомиловский студенческий городок - 6",
        "address": "Москва, Ленинский проспект, д. 4А, стр. 23",
        "info": "В здании общежития есть столовая и прачечная.",
        "img": "https://cdn1.iconfinder.com/data/icons/university-indigo-vol-2/256/Roommate-1024.png",
        "loc":
        [
            [55.7391461, 37.5422278],  # общежитие ДСГ6
            [55.7391370, 37.5423366],
            [55.7391098, 37.5423295],
            [55.7390921, 37.5425414],
            [55.7391195, 37.5425487],
            [55.7391119, 37.5426394],
            [55.7392134, 37.5426662],
            [55.7392479, 37.5422546],
            [55.7394044, 37.5422960],
            [55.7394914, 37.5423190],
            [55.7396940, 37.5423726],
            [55.7397094, 37.5421883],
            [55.7389560, 37.5419891],
            [55.7389405, 37.5421734],
            [55.7391461, 37.5422278]
        ]},
        {
        "name": "Общежитие Дорогомиловский студенческий городок - 5",
        "address": "Москва, Ленинский проспект, д. 4А, стр. 23",
        "info": "В здании общежития сть столовая и прачечная.",
        "img": "https://cdn1.iconfinder.com/data/icons/university-indigo-vol-2/256/Roommate-1024.png",
        "loc":
        [
            [55.7394044, 37.5422960],  # общежитие ДСГ5
            [55.7394914, 37.5423190],
            [55.7394570, 37.5427306],
            [55.7396566, 37.5427834],
            [55.7396409, 37.5429705],
            [55.7394425, 37.5429180],
            [55.7394448, 37.5428903],
            [55.7393314, 37.5428603],
            [55.7393285, 37.5428953],
            [55.7391978, 37.5428607],
            [55.7392007, 37.5428262],
            [55.7390974, 37.5427989],
            [55.7390943, 37.5428361],
            [55.7388922, 37.5427826],
            [55.7389087, 37.5425857],
            [55.7391119, 37.5426394],
            [55.7392134, 37.5426662],
            [55.7393699, 37.5427076],
            [55.7394044, 37.5422960]
        ]},
        {
        "name": "Общежитие Металлург-1",
        "address": "Москва, ул. Профсоюзная, д. 83, к. 1",
        "info": "На территории есть прачечная, магазины. Рядом с общежитием находится спорткомплекс Университета МИСИС, в котором проходят пары по физической культуре.",
        "img": "https://cdn1.iconfinder.com/data/icons/university-indigo-vol-2/256/Roommate-1024.png",
        "loc":
        [
            [55.64587, 37.53011],  # общежитие М1
            [55.64596, 37.52975],
            [55.64608, 37.52985],
            [55.64601, 37.53014],
            [55.64608, 37.5302],
            [55.64594, 37.5307],
            [55.64582, 37.5306],
            [55.64593, 37.53017],
            [55.64587, 37.53011]
        ]},
        {
        "name": "Общежитие Металлург-2",
        "address": "Москва, ул. Профсоюзная, д. 83, к. 2",
        "info": "На территории есть прачечная, магазины. Рядом с общежитием находится спорткомплекс Университета МИСИС, в котором проходят пары по физической культуре.",
        "img": "https://cdn1.iconfinder.com/data/icons/university-indigo-vol-2/256/Roommate-1024.png",
        "loc":
        [
            [55.64523, 37.53008], # общежитие М2
            [55.64548, 37.53029],
            [55.64551, 37.53017],
            [55.64566, 37.5303],
            [55.6456, 37.53051],
            [55.64549, 37.53042],
            [55.64546, 37.53054],
            [55.64517, 37.5303],
            [55.64523, 37.53008]
        ]},
        {
        "name": "Общежитие Металлург-3",
        "address": "Москва, ул. Профсоюзная, д. 83, к. 3",
        "info": "На территории есть прачечная, магазины. Рядом с общежитием находится спорткомплекс Университета МИСИС, в котором проходят пары по физической культуре.",
        "img": "https://cdn1.iconfinder.com/data/icons/university-indigo-vol-2/256/Roommate-1024.png",
        "loc":
        [
            [55.64486, 37.5288], # общежитие М3
            [55.64518, 37.52906],
            [55.64519, 37.529],
            [55.64536, 37.52914],
            [55.6453, 37.52936],
            [55.64517, 37.52926],
            [55.64514, 37.52938],
            [55.64479, 37.52908],
            [55.64486, 37.5288]
        ]},
    ]
}
