from fastapi import FastAPI

app = FastAPI()

@app.get("/")
async def read_root():
    return {"message": "Hello, World!"}

coordinates_of_buildings = {
    "корпус Е": [{'lat': 55.728362, 'lon': 37.607575},
                 {'lat': 55.728450, 'lon': 37.607417},
                 {'lat': 55.728614, 'lon': 37.607712},
                 {'lat': 55.728362, 'lon': 37.607866}],

    "корпус П": [{'lat': 55.727574, 'lon': 37.606801},
                 {'lat': 55.727666, 'lon': 37.606640},
                 {'lat': 55.727701, 'lon': 37.606702},
                 {'lat': 55.727779, 'lon': 37.606566},
                 {'lat': 55.727951, 'lon': 37.606865},
                 {'lat': 55.727919, 'lon': 37.606913},
                 {'lat': 55.727875, 'lon': 37.606830},
                 {'lat': 55.727824, 'lon': 37.606920},
                 {'lat': 55.727923, 'lon': 37.607096},
                 {'lat': 55.727832, 'lon': 37.607258}],
}
