corp = {
    "color": "MediumBlue",
    "weight": 3,
    "building": [{
      "name": "Корпус Е",
      "address": "Москва, Ленинский проспект, д. 4А, стр. 23",
      "info": "Находится на ремонте.",
      "img": "https://misis.ru/files/-/4ab8d9a1f3a01ab39a6125a1fc175fa9/MISIS_logoblock_deskFull_inv_eng_RGB-01_1.png",
      "loc":
      [
        [55.7283, 37.6075], # корпус Е
        [55.72839, 37.60735],
        [55.72854, 37.60759],
        [55.72855, 37.60758],
        [55.72858, 37.607630],
        [55.72857, 37.60764],
        [55.72859, 37.60769],
        [55.72851, 37.60785],
        [55.7284, 37.60768],
        [55.72839, 37.6077],
        [55.72836, 37.60765],
        [55.72837, 37.60763],
        [55.7283, 37.6075]
      ]},
      {
      "name": "Корпус П",
      "address": "Москва, Ленинский проспект, д. 6, стр. 20",
      "info": "В здании проводятся множество различных курсов, преимущественно связанных с IT (Скилфэктори, Skillbox).",
      "img": "https://misis.ru/files/-/4ab8d9a1f3a01ab39a6125a1fc175fa9/MISIS_logoblock_deskFull_inv_eng_RGB-01_1.png",
      "loc":
      [
        [55.72758, 37.60679], # корпус П
        [55.72766, 37.60663],
        [55.7277, 37.60669],
        [55.72778, 37.60655],
        [55.72794, 37.60684],
        [55.72791, 37.6069],
        [55.72786, 37.60682],
        [55.72782, 37.6069],
        [55.72792, 37.60708],
        [55.72783, 37.60723],
        [55.72758, 37.60679]
      ]},
      {
      "name": "Корпус Б",
      "address": "Москва, Ленинский проспект, д. 4",
      "info": "Главный корпус университета. Через этот корпус можно попасть по переходам в центральную столовую и корпус А.",
      "img": "https://misis.ru/files/-/4ab8d9a1f3a01ab39a6125a1fc175fa9/MISIS_logoblock_deskFull_inv_eng_RGB-01_1.png",
      "loc":
      [
        [55.7283959, 37.6094764], # корпус Б
        [55.7281505, 37.6090622],
        [55.7283126, 37.6087605],
        [55.7283452, 37.6088167],
        [55.7283807, 37.6088160],
        [55.7284132, 37.6088154],
        [55.7286147, 37.6084372],
        [55.7283431, 37.6079523],
        [55.7277131, 37.6091064],
        [55.7280121, 37.6096294],
        [55.7281271, 37.6094119],
        [55.7282903, 37.6096873],
        [55.7283959, 37.6094764]
      ]},
      {
      "name": "Корпус Г",
      "address": "Москва, Ленинский проспект, д. 6, стр. 3",
      "info": "Внутри расположен музей НИТУ МИСИС и студенческий офис В нём есть переходы в корпуса А, Г розовый, Л, Т.",
      "img": "https://misis.ru/files/-/4ab8d9a1f3a01ab39a6125a1fc175fa9/MISIS_logoblock_deskFull_inv_eng_RGB-01_1.png",
      "loc":
      [
        [55.7268349, 37.6059714],  # корпус Г
        [55.7268198, 37.6059953],
        [55.7267696, 37.6059063],
        [55.7266122, 37.6062018],
        [55.7266621, 37.6062653],
        [55.7266468, 37.6062969],
        [55.7270828, 37.6070916],
        [55.7274530, 37.6077666],
        [55.7276411, 37.6074411],
        [55.7273767, 37.6069543],
        [55.7273437, 37.6068956],
        [55.7268349, 37.6059714]
      ]},
      {
      "name": "Корпус А",
      "address": "Москва, Ленинский проспект, д. 6, стр. 2",
      "info": "Есть переходы в корпусы Г и Б.",
      "img": "https://misis.ru/files/-/4ab8d9a1f3a01ab39a6125a1fc175fa9/MISIS_logoblock_deskFull_inv_eng_RGB-01_1.png",
      "loc":
      [
        [55.72695, 37.60788], #корпус А
        [55.72702, 37.60777],
        [55.72704, 37.60782],
        [55.7271, 37.60772],
        [55.72721, 37.60792],
        [55.72717, 37.60799],
        [55.72729, 37.6082],
        [55.72766, 37.60757],
        [55.72777, 37.60776],
        [55.72729, 37.60859],
        [55.727, 37.60806],
        [55.72701, 37.60804],
        [55.72696, 37.60796],
        [55.72698, 37.60793],
        [55.72695, 37.60788]
      ]},
      {
      "name": "Спортивный комплекс",
      "address": "Москва, Ленинский проспект, д. 6, стр. 7",
      "info": "Включает в себя игровой зал, тренажёрный зал, зал бокса, 2 зала ОФП.",
      "img": "https://misis.ru/files/-/4ab8d9a1f3a01ab39a6125a1fc175fa9/MISIS_logoblock_deskFull_inv_eng_RGB-01_1.png",
      "loc":
      [
        [55.72679, 37.60558], #Спортивный комплекс
        [55.72685, 37.60546],
        [55.72682, 37.60542],
        [55.72706, 37.60496],
        [55.72712, 37.60507],
        [55.72707, 37.60518],
        [55.7272, 37.6054],
        [55.727, 37.60579],
        [55.7269, 37.60562],
        [55.72686, 37.60569],
        [55.72679, 37.60558]
      ]},
      {
      "name": "Корпус Л",
      "address": "Москва, Ленинский проспект, д. 6, стр. 7",
      "info": "Считается лабораторным корпусом.",
      "img": "https://misis.ru/files/-/4ab8d9a1f3a01ab39a6125a1fc175fa9/MISIS_logoblock_deskFull_inv_eng_RGB-01_1.png",
      "loc":
      [
        [55.72707, 37.60518], #Корпус Л
        [55.72717, 37.60499],
        [55.72824, 37.60682],
        [55.72821, 37.60687],
        [55.7283, 37.60704],
        [55.72793, 37.60772],
        [55.72777, 37.60744],
        [55.72808, 37.6069],
        [55.72707, 37.60518]
      ]},
      {
      "name": "Корпус Д",
      "address": "Москва, Ленинский проспект, д. 6, стр. 21",
      "info": "Ассоциация инженерного образования России.",
      "img": "https://misis.ru/files/-/4ab8d9a1f3a01ab39a6125a1fc175fa9/MISIS_logoblock_deskFull_inv_eng_RGB-01_1.png",
      "loc":
      [
        [55.7273, 37.60628], #Корпус Д
        [55.72747, 37.60599],
        [55.72766, 37.60634],
        [55.72749, 37.60663],
        [55.7273, 37.60628]
      ]},
      {
      "name": "Розовое крыло",
      "address": "Москва, Ленинский проспект, д. 6, стр. 3",
      "info": "Здесь находится кафедра иностранных языков, а также медпункт.",
      "img": "https://misis.ru/files/-/4ab8d9a1f3a01ab39a6125a1fc175fa9/MISIS_logoblock_deskFull_inv_eng_RGB-01_1.png",
      "loc":
      [
        [55.72616, 37.60665], #Розовое Крыло
        [55.72676, 37.60553],
        [55.72687, 37.60571],
        [55.72639, 37.60663],
        [55.72648, 37.60678],
        [55.72651, 37.60672],
        [55.72658, 37.60684],
        [55.72654, 37.60692],
        [55.72658, 37.607],
        [55.72657, 37.60702],
        [55.72661, 37.60709],
        [55.72653, 37.60724],
        [55.72644, 37.6071],
        [55.72643, 37.60711],
        [55.72616, 37.60665]
      ]},
      {
      "name": "Корпус К",
      "address": "Москва, ул. Крымский Вал, д. 3",
      "info": "Учебно-лабораторный корпус с современным ремонтом и столовой.",
      "img": "https://misis.ru/files/-/4ab8d9a1f3a01ab39a6125a1fc175fa9/MISIS_logoblock_deskFull_inv_eng_RGB-01_1.png",
      "loc":
      [
        [55.72938, 37.60973], #Корпус К
        [55.72969, 37.61006],
        [55.7299, 37.60943],
        [55.72958, 37.60909],
        [55.72967, 37.60883],
        [55.73008, 37.60927],
        [55.72978, 37.61015],
        [55.72983, 37.6102],
        [55.72975, 37.61045],
        [55.7293, 37.60997],
        [55.72938, 37.60973]
      ]},
      {
      "name": "Корпус В",
      "address": "Москва, Ленинский проспект, д. 2А",
      "info": "Корпус, в котором находятся кабинеты руководства.",
      "img": "https://misis.ru/files/-/4ab8d9a1f3a01ab39a6125a1fc175fa9/MISIS_logoblock_deskFull_inv_eng_RGB-01_1.png",
      "loc":
      [
        [55.72777, 37.60744], #Корпус В
        [55.72808, 37.6069],
        [55.72814, 37.607],
        [55.72821, 37.60688],
        [55.7283, 37.60704],
        [55.72792, 37.60772],
        [55.72777, 37.60744]
      ]},
      {
      "name": "Корпус Н",
      "address": "Москва, Ленинский проспект, д. 2/4",
      "info": "В нём расположена центральная столовая университета.",
      "img": "https://misis.ru/files/-/4ab8d9a1f3a01ab39a6125a1fc175fa9/MISIS_logoblock_deskFull_inv_eng_RGB-01_1.png",
      "loc":
      [
        [55.72868, 37.60872], #Корпус Н
        [55.72898, 37.60813],
        [55.72917, 37.60843],
        [55.72887, 37.60901],
        [55.72868, 37.60872]
      ]},
      {
      "name": "Преподавательский вход",
      "address": "Москва, Ленинский проспект, д. 4",
      "info": "Вход для преподавателей.",
      "img": "https://misis.ru/files/-/4ab8d9a1f3a01ab39a6125a1fc175fa9/MISIS_logoblock_deskFull_inv_eng_RGB-01_1.png",
      "loc":
      [
        [55.72829, 37.60969], #Преподавательский вход
        [55.7284, 37.60948],
        [55.72875, 37.61008],
        [55.72864, 37.61028],
        [55.72829, 37.60969]
      ]},
      {
      "name": "Точка инноваций",
      "address": "Москва, Ленинский проспект, д. 6, стр. 7",
      "info": "Программа развития ЦТТ НИТУ МИСИС направлена на поддержку технологического лидерства Российской Федерации и её вхождению в число крупнейших экономик мира в приоритетных областях научно-технологического развития.",
      "img": "https://misis.ru/files/-/4ab8d9a1f3a01ab39a6125a1fc175fa9/MISIS_logoblock_deskFull_inv_eng_RGB-01_1.png",
      "loc":
      [
        [55.727, 37.60579], #Точка инноваций
        [55.7272, 37.6054],
        [55.72745, 37.60584],
        [55.72724, 37.60621],
        [55.727, 37.60579]
      ]}
    ]
}
